crm-setup-frontend/artillery.yml
config:
      target: "http://localhost:3007"
      phases:
        - duration: 60
          arrivalRate: 10
      defaults:
        headers:
          Content-Type: application/json
          Authorization: "Bearer test-token"

    scenarios:
      - name: "Load test API"
        flow:
          - get:
              url: "/api/v1/health"
          - post:
              url: "/api/login"
              json:
                email: "test@example.com"
                password: "password"
          - get:
              url: "/api/v1/dashboard"